// Переименовать существующий файл
//***************использовать. подумать над поиском в папке********************************
//***************Концепт: сначала найти папку, потом запустить ее адрес в эту функцию******
//*************** запустить функцию поиска файла в папке и переименовать*******************
			//void RenameFile()
			//{
			//	char oldName[50], newName[50];
			//
			//	// В одной переменной запомним существующее имя (oldName), 
			//	cout << "Enter old name:";
			//	cin >> oldName;
			//
			//	// А в другой новое имя(newName)
			//	cout << "Enter new name:";
			//	cin >> newName;
			//
			//	// Произведем переименование и проверку результата
			//	if (rename(oldName, newName) != 0)
			//		cout << "Error!\n Couldn't rename file. Check old and new filename...\n\n";
			//	else
			//		cout << "Ok...\n\n";
			//}
//***********************конец функции*********************************************************

//*********************************************************************************************
		// Удалить существующий файл
		//void RemoveFile()
		//{
		//	char Name[50];
		//	// Получаем имя и путь к удаляемому файлу
		//	cout << "Enter name:";
		//	cin >> Name;
		//
		//	//Удаляем файл и проверяем результат	
		//	if (remove(Name) != 0)
		//		cout << "Error!\n Couldn't remove file. Check filename...\n";
		//	else
		//		cout << "Ok...\n";
		//}
//***************************конец функции*******************************************************

